# Handling Missing Data

In [1]:
#NAN values are replaced with mean average but if there are many NAN values then we delete that row
#2 methods: filling and filtering
#Redundant(Duplicate data) --> Remove it
#Replacing Values

In [11]:
import pandas as pd
import numpy as np
from numpy import nan as NA

'''dropna-> Filter axis labels based on whether values for each label have missing data, with varying thresholds for how
much missing data to tolerate.
fillna-> Fill in missing data with some value or using an interpolation method such as 'ffill' or 'bfill'.
isnull-> Return boolean values indicating which values are missing/NA.
notnull-> Negation of isnull.'''

In [20]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [7]:
string_data.isnull() #returns True where there is a NaN.

0    False
1    False
2     True
3    False
dtype: bool

In [9]:
#The built-in Python None value is also treated as NA in object arrays
string_data[0]=None
string_data

0         None
1    artichoke
2          NaN
3      avocado
dtype: object

In [10]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [15]:
s1 = pd.Series([1,2,3,4,5,NA]) #NaN is imported as NA or use np.nan
s1.isnull() #returns true if there is nan.

0    False
1    False
2    False
3    False
4    False
5     True
dtype: bool

In [22]:
s1[s1.isnull()]

5   NaN
dtype: float64

In [17]:
s1.notnull() #negation of isnull

0     True
1     True
2     True
3     True
4     True
5    False
dtype: bool

In [18]:
s1.dropna() #drop nan value

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
dtype: float64

In [23]:
s = pd.Series([np.nan,1,2,3,np.nan,4,5,np.nan])
s

0    NaN
1    1.0
2    2.0
3    3.0
4    NaN
5    4.0
6    5.0
7    NaN
dtype: float64

In [29]:
s = s[s.notnull()] #notnull and dropna from these two we can remove nan values
s

1    1.0
2    2.0
3    3.0
5    4.0
6    5.0
dtype: float64

In [33]:
s = pd.Series([np.nan,1,2,3,np.nan,4,5,np.nan])
s.dropna(inplace=True)
s

1    1.0
2    2.0
3    3.0
5    4.0
6    5.0
dtype: float64

## IN DATAFRAME

In [1]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],[NA, NA, NA], [NA, 6.5, 3.]])
data

NameError: name 'pd' is not defined

In [73]:
data.dropna() #cant be apply coz it removes whole row if NaN is there 
#in documentation how='any'-> koi ek b true to yeh kam krdo (koi ek b NAN to drop)

     0    1    2
0  1.0  6.5  3.0

In [74]:
data.dropna(how='all') #all-> drop tab krunga jab sary NA honge -> 2nd index removes as its all NaN

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [75]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [76]:
data.dropna(thresh=2) #atleast 2 non-NaN values hon tou urado 1 or 2 index ki line nhi bachi q k ismy 2 hain

     0    1    2
0  1.0  6.5  3.0
3  NaN  6.5  3.0

In [77]:
data.dropna(thresh=2,axis=1)

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [78]:
data.iloc[:2,1] = NA
print(data)
data.dropna(thresh=2,axis=1) #ask

     0    1    2
0  1.0  NaN  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

     0    2
0  1.0  3.0
1  1.0  NaN
2  NaN  NaN
3  NaN  3.0

In [79]:
df = pd.DataFrame(np.random.randn(7, 3))
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA
df

          0         1         2
0  1.924931       NaN       NaN
1  1.239036       NaN       NaN
2  2.111204       NaN -1.581941
3 -1.003755       NaN -0.489202
4  1.015840  3.935089  0.698068
5 -0.172678 -0.873615 -0.676439
6 -1.936520 -0.863716  2.244961

In [80]:
df.fillna(0) #NaN->0

          0         1         2
0  1.924931  0.000000  0.000000
1  1.239036  0.000000  0.000000
2  2.111204  0.000000 -1.581941
3 -1.003755  0.000000 -0.489202
4  1.015840  3.935089  0.698068
5 -0.172678 -0.873615 -0.676439
6 -1.936520 -0.863716  2.244961

In [81]:
df.fillna({1: 1,2: 2}) #ek dictionary pass krwai jo 1 column hai uspar fill krdo 1 se , 2 par 2 se

          0         1         2
0  1.924931  1.000000  2.000000
1  1.239036  1.000000  2.000000
2  2.111204  1.000000 -1.581941
3 -1.003755  1.000000 -0.489202
4  1.015840  3.935089  0.698068
5 -0.172678 -0.873615 -0.676439
6 -1.936520 -0.863716  2.244961

In [82]:
df.fillna({1: df[1].mean(),2: df[1].mean()}) #1 column ka mean, 2 column ka mean or fill hojyenge NA ki jagah

          0         1         2
0  1.924931  0.732586  0.732586
1  1.239036  0.732586  0.732586
2  2.111204  0.732586 -1.581941
3 -1.003755  0.732586 -0.489202
4  1.015840  3.935089  0.698068
5 -0.172678 -0.873615 -0.676439
6 -1.936520 -0.863716  2.244961

In [83]:
df.fillna(method='ffill') #NaN se pehle vali value ko NaN ki jagah idhar 0th par NaN hi hai tou har nan ki jagh nan

          0         1         2
0  1.924931       NaN       NaN
1  1.239036       NaN       NaN
2  2.111204       NaN -1.581941
3 -1.003755       NaN -0.489202
4  1.015840  3.935089  0.698068
5 -0.172678 -0.873615 -0.676439
6 -1.936520 -0.863716  2.244961

In [84]:
df.iloc[:1,1] = 1.1 #yahan mene first value 1.1 krdia
df.fillna(method='ffill')

          0         1         2
0  1.924931  1.100000       NaN
1  1.239036  1.100000       NaN
2  2.111204  1.100000 -1.581941
3 -1.003755  1.100000 -0.489202
4  1.015840  3.935089  0.698068
5 -0.172678 -0.873615 -0.676439
6 -1.936520 -0.863716  2.244961

In [85]:
df.fillna(method='bfill')

          0         1         2
0  1.924931  1.100000 -1.581941
1  1.239036  3.935089 -1.581941
2  2.111204  3.935089 -1.581941
3 -1.003755  3.935089 -0.489202
4  1.015840  3.935089  0.698068
5 -0.172678 -0.873615 -0.676439
6 -1.936520 -0.863716  2.244961

In [86]:
#last readed value se fill krta hai forward main uper wali last , backward main last wali

In [87]:
df

          0         1         2
0  1.924931  1.100000       NaN
1  1.239036       NaN       NaN
2  2.111204       NaN -1.581941
3 -1.003755       NaN -0.489202
4  1.015840  3.935089  0.698068
5 -0.172678 -0.873615 -0.676439
6 -1.936520 -0.863716  2.244961

In [88]:
df[1][2] = 1.2
df

          0         1         2
0  1.924931  1.100000       NaN
1  1.239036       NaN       NaN
2  2.111204  1.200000 -1.581941
3 -1.003755       NaN -0.489202
4  1.015840  3.935089  0.698068
5 -0.172678 -0.873615 -0.676439
6 -1.936520 -0.863716  2.244961

In [89]:
df.fillna(method='ffill')

          0         1         2
0  1.924931  1.100000       NaN
1  1.239036  1.100000       NaN
2  2.111204  1.200000 -1.581941
3 -1.003755  1.200000 -0.489202
4  1.015840  3.935089  0.698068
5 -0.172678 -0.873615 -0.676439
6 -1.936520 -0.863716  2.244961

In [90]:
df.fillna(method='bfill')

          0         1         2
0  1.924931  1.100000 -1.581941
1  1.239036  1.200000 -1.581941
2  2.111204  1.200000 -1.581941
3 -1.003755  3.935089 -0.489202
4  1.015840  3.935089  0.698068
5 -0.172678 -0.873615 -0.676439
6 -1.936520 -0.863716  2.244961

In [92]:
df

          0         1         2
0  1.924931  1.100000       NaN
1  1.239036       NaN       NaN
2  2.111204  1.200000 -1.581941
3 -1.003755       NaN -0.489202
4  1.015840  3.935089  0.698068
5 -0.172678 -0.873615 -0.676439
6 -1.936520 -0.863716  2.244961

In [93]:
df.fillna(method='ffill',limit=1)

          0         1         2
0  1.924931  1.100000       NaN
1  1.239036  1.100000       NaN
2  2.111204  1.200000 -1.581941
3 -1.003755  1.200000 -0.489202
4  1.015840  3.935089  0.698068
5 -0.172678 -0.873615 -0.676439
6 -1.936520 -0.863716  2.244961

In [94]:
df.fillna(method='bfill',limit=1)

          0         1         2
0  1.924931  1.100000       NaN
1  1.239036  1.200000 -1.581941
2  2.111204  1.200000 -1.581941
3 -1.003755  3.935089 -0.489202
4  1.015840  3.935089  0.698068
5 -0.172678 -0.873615 -0.676439
6 -1.936520 -0.863716  2.244961

In [112]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],'k2': [1, 1, 2, 3, 3, 4, 4]})

In [96]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [101]:
data.duplicated() #dono columns lerha hai one 1 , two 1 not duplicate,,, but two 4 , two 4 duplicate
#or data.duplicated(['k1','k2'])

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [102]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [104]:
data.duplicated(['k1'])

0    False
1    False
2     True
3     True
4     True
5     True
6     True
dtype: bool

In [103]:
data.drop_duplicates(['k1'])

    k1  k2
0  one   1
1  two   1

In [113]:
data.drop_duplicates(['k1', 'k2'], keep='last') #last wali duplicate value ko retain krega

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
6  two   4

In [117]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
'Pastrami', 'corned beef', 'Bacon',
 'pastrami', 'honey ham', 'nova lox'],
 'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [118]:
meat_to_animal = {
 'bacon': 'cow',
 'pulled pork': 'goat',
 'pastrami': 'cow',
 'corned beef': 'cow',
 'honey ham': 'goat',
 'nova lox': 'salmon'
}
meat_to_animal['bacon']

'cow'

In [119]:
data['food'].str.upper()

0          BACON
1    PULLED PORK
2          BACON
3       PASTRAMI
4    CORNED BEEF
5          BACON
6       PASTRAMI
7      HONEY HAM
8       NOVA LOX
Name: food, dtype: object

In [120]:
lowercased = data['food'].str.lower()
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

## map

In [121]:
a = lambda x:x.upper()
lowercased.map(a) #map is not applied on dataframe we use applymap then

0          BACON
1    PULLED PORK
2          BACON
3       PASTRAMI
4    CORNED BEEF
5          BACON
6       PASTRAMI
7      HONEY HAM
8       NOVA LOX
Name: food, dtype: object

In [122]:
data['animal'] = lowercased.map(meat_to_animal) #ek naay animal ka column banao lowercased k andar food ko lower kia
#ab wo food uthaye ga map k pas gya meat to animal dictionary ki key value se map kia agr matched hogi to value return 
data

          food  ounces  animal
0        bacon     4.0     cow
1  pulled pork     3.0    goat
2        bacon    12.0     cow
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     cow
6     pastrami     3.0     cow
7    honey ham     5.0    goat
8     nova lox     6.0  salmon

In [138]:
mydata = pd.DataFrame({'name':['mids','hash','mar','max','fari','wari']})
mydata

   name
0  mids
1  hash
2   mar
3   max
4  fari
5  wari

In [139]:
name_to_age = {
    'mids' : 20,
    'hash' : 18,
    'mar':19,
    'max':19,
    'fari':19,
    'wari':17,
}

In [140]:
mydata['age'] = mydata['name'].map(name_to_age)
mydata

   name  age
0  mids   20
1  hash   18
2   mar   19
3   max   19
4  fari   19
5  wari   17

In [141]:
name_to_ageindex = {
    0 : 20,
    1 : 18,
    2:19,
    3:19,
    4:19,
    5:17,
}

In [142]:
mydata['age'] = mydata.index.map(name_to_ageindex)
mydata

   name  age
0  mids   20
1  hash   18
2   mar   19
3   max   19
4  fari   19
5  wari   17

# Replace

In [143]:
#first argumnet -> jisko replace krna hai , dsra-> jisko replace krna

In [146]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [147]:
data.replace(-999,np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [148]:
data.replace([-999,-1000],[np.nan,0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [149]:
data.replace({-999:np.nan,-1000:0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [152]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
index=['Ohio', 'Colorado', 'New York'],
columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [154]:
transform = lambda x: x[:4].upper()
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [158]:
data.rename(index=str.title, columns=str.upper)

          ONE  TWO  THREE  FOUR
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [157]:
data.rename(index={'OHIO': 'INDIANA'},
columns={'three': 'peekaboo'})

          one  two  peekaboo  four
Ohio        0    1         2     3
Colorado    4    5         6     7
New York    8    9        10    11